Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_MicSD_147_ESP32/0519_MicSD_147_ESP32.ino
/**
 * Product: XIAO 1.47 inch Touch Display (JD9853A 172x320 + AXS5106L touch)
 * Display: JD9853A 172x320, BGR, capacitive touch
 * Target:  XIAO ESP32-S3 Plus (RST=13, BL=12). For nRF52840 Plus use the sibling
 *          nRF52840 Plus folder (RST=38, BL=37).
 * Wiring:  CS=D2, DC=D3, MOSI=D10, SCLK=D8; RST=13, BL=12.
 * Demo:    LCD+MIC+SD coexist recorder: captures 5s PDM audio to RAM, writes 3 WAVs
 *          (raw/HP/auto-notch DSP) + stats CSV to SD. Goertzel tonal-noise detection + biquad notch.
 *
 * Ported from XIAO-Display-Board-main (0519_MicSD_147_ESP32, Arduino_GFX). The Seeed_GFX
 * Board/Config templates replace the original bus+panel setup, manual MADCTL/invert/
 * swapbytes, and (for TFT_eSPI) the driver.h User_Setup. Drops the raw low-noise LCD bus
 * pokes (writeCommand 0x20 INVOFF / 0x39 IDMON / 0xC6) and the manual MADCTL 0x48 fix —
 * Driver_JD9853A/Config_Seeed_1inch47_Touch_JD9853A handle inversion/orientation; reach the
 * bus via display.panel().driver().bus() only if truly needed.
 */

#include <Seeed_GFX.h>
#include "board/boards/XIAO_LCD_Board.h"
#include "driver/tft/Driver_JD9853A.h"
#include "panel/Panel_TFT.h"

#include <Arduino.h>
#include <SPI.h>
#include <SD.h>
#include <WiFi.h>
#include "esp_idf_version.h"

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

#include <driver/gpio.h>
#include <math.h>
#include <stdlib.h>

// ========================= User config =========================

// Keep backlight ON during recording.
// If audio is still noisy, test with 0 to isolate backlight contribution,
// but the product target is 1.
#define LCD_BACKLIGHT_ON_DURING_RECORDING 1

static constexpr uint32_t RECORD_SECONDS = 5;
static constexpr uint32_t MIC_SAMPLE_RATE_HZ = 16000;

// C0/C1 were similar in the MIC-only test; keep normal clock first.
static constexpr bool MIC_CLK_INVERT = false;

// Cleaned file gain. Increase to 2.5f or 3.0f if too quiet.
// Reduce to 1.5f if clipping.
static constexpr float CLEAN_GAIN = 2.0f;

// Noise gate is OFF for honest evaluation. Try 30~80 later only for demo polish.
static constexpr int32_t CLEAN_NOISE_GATE = 0;

// Auto notch parameters for /COEX_DSP.WAV
static constexpr float NOTCH_Q = 18.0f;
static constexpr uint32_t PROFILE_MS = 900;
static constexpr uint32_t NOTCH_SEARCH_START_HZ = 300;
static constexpr uint32_t NOTCH_SEARCH_END_HZ = 7600;
static constexpr uint32_t NOTCH_SEARCH_STEP_HZ = 100;

// Lower PDM CLK drive strength to reduce EMI/coupling.
// Set 0 if PDM becomes unstable.
#define REDUCE_PDM_CLK_DRIVE 1

// ========================= Pin map =========================

static constexpr uint8_t MIC_CLK_PIN    = D0;
static constexpr uint8_t MIC_DATA_PIN   = D1;

static constexpr uint8_t LCD_CS_PIN     = D2;
static constexpr uint8_t LCD_DC_PIN     = D3;

static constexpr uint8_t SD_CS_PIN      = D6;
static constexpr uint8_t SPI_SCK_PIN    = D8;
static constexpr uint8_t SD_MISO_PIN    = D9;
static constexpr uint8_t SPI_MOSI_PIN   = D10;

static constexpr uint8_t BTN_RECORD_PIN = D15;

// ========================= Display =========================

Seeed_GFX display;

#if defined(ESP32)
// SD shares the LCD's HSPI host (SPI3) with CS arbitration (LCD_CS=D2 / SD_CS=D6).
// The LCD's Bus_SPI uses its own SPIClass(HSPI); this is a second SPIClass on the
// same host (spiStartBus returns a per-host singleton; beginTransaction serializes
// via the bus lock) so the SD does NOT use the default SPI (FSPI/SPI2), which would
// fight the LCD's HSPI for the shared D8/D10 GPIO mux (rectify #74).
SPIClass sdSpi(HSPI);
#endif

static constexpr int8_t LCD_RST_PIN = 13;  // XIAO ESP32-S3 Plus
static constexpr int8_t LCD_BL_PIN  = 12;

static constexpr int LCD_W = 172;
static constexpr int LCD_H = 320;

static constexpr uint16_t C_BLACK  = 0x0000;
static constexpr uint16_t C_WHITE  = 0xFFFF;
static constexpr uint16_t C_GREEN  = 0x07E0;
static constexpr uint16_t C_RED    = 0xF800;
static constexpr uint16_t C_CYAN   = 0x07FF;
static constexpr uint16_t C_YELLOW = 0xFFE0;
static constexpr uint16_t C_ORANGE = 0xFD20;
static constexpr uint16_t C_GRAY   = 0x8410;
static constexpr uint16_t C_DIM    = 0x2104;

// ========================= Audio =========================

static constexpr size_t MIC_SAMPLES_PER_READ = 256;
static constexpr uint16_t AUDIO_BITS_PER_SAMPLE = 16;
static constexpr uint16_t AUDIO_CHANNELS = 1;
static constexpr uint32_t AUDIO_BYTE_RATE = MIC_SAMPLE_RATE_HZ * AUDIO_CHANNELS * AUDIO_BITS_PER_SAMPLE / 8;
static constexpr uint16_t AUDIO_BLOCK_ALIGN = AUDIO_CHANNELS * AUDIO_BITS_PER_SAMPLE / 8;
static constexpr uint32_t RECORD_TARGET_BYTES = MIC_SAMPLE_RATE_HZ * AUDIO_BLOCK_ALIGN * RECORD_SECONDS;
static constexpr uint32_t RECORD_TARGET_SAMPLES = RECORD_TARGET_BYTES / sizeof(int16_t);
static constexpr uint32_t PROFILE_SAMPLES = (MIC_SAMPLE_RATE_HZ * PROFILE_MS) / 1000;

int16_t micBuf[MIC_SAMPLES_PER_READ];
uint8_t *recBuffer = nullptr;

#if ESP_IDF_VERSION_MAJOR >= 5
static i2s_chan_handle_t g_i2sRxChan = nullptr;
#else
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;
#endif

struct AudioStats {
  int32_t mean;
  uint32_t peak;
  uint32_t rms;
  uint32_t bytes;
  uint32_t elapsedMs;
};

bool lcdOk = false;
bool sdMounted = false;
bool busy = false;
uint32_t lastButtonMs = 0;

AudioStats rawStats = {};
AudioStats hpStats = {};
AudioStats dspStats = {};
float detectedNoiseHz = 0.0f;

// ========================= GPIO and system =========================

static void disableRadios() {
  WiFi.mode(WIFI_OFF);
  WiFi.disconnect(true);
}

// Keep the SD chip-select deasserted so the shared SPI bus is idle. Bus_SPI owns
// LCD_CS (D2) and parks it HIGH between transactions, so only SD_CS is touched here.
static void spiDevicesIdle() {
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
}

static void printHeader() {
  Serial.println();
  Serial.println("=== XIAO ESP32-S3 Plus LCD+MIC+SD coexist recorder v6 ===");
  Serial.printf("LCD: Seeed_GFX JD9853A, CS=D2(%d), DC=D3(%d), SCK=D8(%d), MOSI=D10(%d), RST=%d, BL=%d\n",
                LCD_CS_PIN, LCD_DC_PIN, SPI_SCK_PIN, SPI_MOSI_PIN,
                LCD_RST_PIN, LCD_BL_PIN);
  Serial.printf("MIC: CLK=D0(%d), DATA=D1(%d), sample=%lu Hz, clk_inv=%u\n",
                MIC_CLK_PIN, MIC_DATA_PIN, (unsigned long)MIC_SAMPLE_RATE_HZ, MIC_CLK_INVERT ? 1 : 0);
  Serial.printf("SD : CS=D6(%d), SCK=D8(%d), MISO=D9(%d), MOSI=D10(%d)\n",
                SD_CS_PIN, SPI_SCK_PIN, SD_MISO_PIN, SPI_MOSI_PIN);
  Serial.printf("Record buffer: %lu bytes, free heap=%lu\n",
                (unsigned long)RECORD_TARGET_BYTES, (unsigned long)ESP.getFreeHeap());
}

