Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_MicSD_147_ESP32/0519_MicSD_147_ESP32.ino
// ========================= LCD helpers =========================

static bool initLcd() {
  spiDevicesIdle();

  if (!display.begin<
          Board_XIAO_1inch47_Touch_Display<LCD_RST_PIN, LCD_BL_PIN>,
          Config_Seeed_1inch47_Touch_JD9853A>()) {
    Serial.println(display.lastResult().message);
    lcdOk = false;
    return false;
  }

  display.setTextWrap(false);
  lcdOk = true;

  Serial.println("[LCD] OK");
  return true;
}

static void lcdText(int x, int y, const char *s, uint16_t color = C_WHITE, uint16_t bg = C_BLACK, uint8_t size = 1) {
  if (!lcdOk) return;
  display.setTextSize(size);
  display.setTextColor(color, bg);
  display.setCursor(x, y);
  display.print(s);
}

static void drawFrame(const char *title) {
  if (!lcdOk) return;
  display.fillScreen(C_BLACK);
  display.drawRect(0, 0, LCD_W, LCD_H, C_DIM);
  lcdText(8, 8, title, C_CYAN);
  display.drawFastHLine(0, 34, LCD_W, C_DIM);
}

static void showMessage(const char *l1, uint16_t c1, const char *l2 = nullptr, uint16_t c2 = C_WHITE) {
  if (!lcdOk) return;
  display.fillRect(4, 44, LCD_W - 8, 120, C_BLACK);
  lcdText(8, 48, l1, c1);
  if (l2) lcdText(8, 68, l2, c2);
}

static int vuSegments(uint32_t rms) {
  const uint32_t fullScale = 3000;
  int seg = (int)((rms * 12UL) / fullScale);
  if (seg < 0) seg = 0;
  if (seg > 12) seg = 12;
  return seg;
}

static void drawVu(uint32_t rms) {
  if (!lcdOk) return;

  const int count = 12;
  const int gap = 2;
  const int x = 12;
  const int y = 154;
  const int w = 148;
  const int h = 14;
  const int segW = (w - (count - 1) * gap) / count;
  int segs = vuSegments(rms);

  display.drawRect(8, 148, 156, 26, C_GRAY);

  for (int i = 0; i < count; i++) {
    uint16_t color = C_DIM;
    if (i < segs) {
      if (i < 7) color = C_GREEN;
      else if (i < 10) color = C_YELLOW;
      else color = C_RED;
    }
    display.fillRect(x + i * (segW + gap), y, segW, h, color);
  }
}

static void showReady() {
  if (!lcdOk) initLcd();

  drawFrame("Coexist Rec v6");
  showMessage("Ready", C_GREEN, "USR2: record", C_YELLOW);
  lcdText(8, 98, "Screen stays ON", C_WHITE);
  lcdText(8, 116, "No LCD refresh in rec", C_GRAY);
  lcdText(8, 134, "No SD write in rec", C_GRAY);
}

static void showRecordingStatic() {
  if (!lcdOk) initLcd();

  drawFrame("Coexist Rec v6");
  showMessage("Recording 5s...", C_ORANGE, "Keep quiet first 1s", C_YELLOW);
  lcdText(8, 98, "LCD is ON", C_WHITE);
  lcdText(8, 116, "Static UI only", C_GRAY);
  lcdText(8, 134, "RAM capture only", C_GRAY);

  // Low-noise LCD bus pokes (writeCommand 0x20 INVOFF / 0x39 IDMON / 0xC6) and the
  // manual MADCTL 0x48 fix were here in the original; Driver_JD9853A/Config handle
  // inversion/orientation now, so they are intentionally dropped.

#if LCD_BACKLIGHT_ON_DURING_RECORDING
  digitalWrite(LCD_BL_PIN, HIGH);
#else
  digitalWrite(LCD_BL_PIN, LOW);
#endif

  // Bus_SPI already parks LCD_CS HIGH after each transaction; nothing to do here
  // before PDM starts. (The original re-asserted LCD_CS, which Bus_SPI now owns.)
}

static void showDone(bool ok) {
  if (!lcdOk) initLcd();

  drawFrame("Coexist Rec v6");

  if (ok) {
    showMessage("Saved OK", C_GREEN, "/COEX_DSP.WAV", C_WHITE);

    char buf[48];
    snprintf(buf, sizeof(buf), "HP  P:%lu R:%lu", (unsigned long)hpStats.peak, (unsigned long)hpStats.rms);
    lcdText(8, 98, buf, C_CYAN);

    snprintf(buf, sizeof(buf), "DSP P:%lu R:%lu", (unsigned long)dspStats.peak, (unsigned long)dspStats.rms);
    lcdText(8, 116, buf, C_GREEN);

    snprintf(buf, sizeof(buf), "Notch:%4.0fHz", detectedNoiseHz);
    lcdText(8, 134, buf, C_YELLOW);

    drawVu(dspStats.rms);

    lcdText(8, 198, "/COEX_RAW.WAV", C_GRAY);
    lcdText(8, 216, "/COEX_HP.WAV", C_WHITE);
    lcdText(8, 234, "/COEX_DSP.WAV", C_GREEN);
    lcdText(8, 264, "USR2: again", C_YELLOW);
  } else {
    showMessage("Failed", C_RED, "Check serial log", C_WHITE);
    lcdText(8, 100, "USR2: retry", C_YELLOW);
  }
}

// ========================= WAV helpers =========================

static void putLE16(uint8_t *p, uint16_t v) {
  p[0] = (uint8_t)(v & 0xFF);
  p[1] = (uint8_t)((v >> 8) & 0xFF);
}

static void putLE32(uint8_t *p, uint32_t v) {
  p[0] = (uint8_t)(v & 0xFF);
  p[1] = (uint8_t)((v >> 8) & 0xFF);
  p[2] = (uint8_t)((v >> 16) & 0xFF);
  p[3] = (uint8_t)((v >> 24) & 0xFF);
}

static bool writeWavHeader(File &f, uint32_t dataBytes) {
  uint8_t header[44] = {0};
  memcpy(header + 0, "RIFF", 4);
  putLE32(header + 4, 36 + dataBytes);
  memcpy(header + 8, "WAVEfmt ", 8);
  putLE32(header + 16, 16);
  putLE16(header + 20, 1);
  putLE16(header + 22, AUDIO_CHANNELS);
  putLE32(header + 24, MIC_SAMPLE_RATE_HZ);
  putLE32(header + 28, AUDIO_BYTE_RATE);
  putLE16(header + 32, AUDIO_BLOCK_ALIGN);
  putLE16(header + 34, AUDIO_BITS_PER_SAMPLE);
  memcpy(header + 36, "data", 4);
  putLE32(header + 40, dataBytes);
  return f.write(header, sizeof(header)) == sizeof(header);
}

// ========================= SD =========================

static bool mountSd() {
  if (sdMounted) return true;

  spiDevicesIdle();
  sdSpi.begin(SPI_SCK_PIN, SD_MISO_PIN, SPI_MOSI_PIN, SD_CS_PIN);
  delay(30);

  const uint32_t freqs[] = { 4000000, 1000000, 400000 };
  for (uint8_t i = 0; i < sizeof(freqs) / sizeof(freqs[0]); i++) {
    digitalWrite(SD_CS_PIN, HIGH);
    Serial.printf("[SD] Trying %lu Hz...\n", (unsigned long)freqs[i]);

    if (SD.begin(SD_CS_PIN, sdSpi, freqs[i])) {
      sdMounted = true;
      uint64_t cardSizeMB = SD.cardSize() / (1024ULL * 1024ULL);
      Serial.printf("[SD] OK, card size=%llu MB, freq=%lu Hz\n",
                    cardSizeMB, (unsigned long)freqs[i]);
      return true;
    }
  }

  Serial.println("[SD] Mount failed");
  return false;
}

static void sdEndForRecording() {
  if (sdMounted) {
    Serial.println("[SD] end before capture");
    SD.end();
    sdMounted = false;
    delay(80);
  }

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
}

static bool writeBufferToWav(const char *path, const uint8_t *data, uint32_t bytes) {
  if (!mountSd()) return false;

  SD.remove(path);
  File f = SD.open(path, FILE_WRITE);
  if (!f) {
    Serial.printf("[SAVE] failed to open %s\n", path);
    return false;
  }

  if (!writeWavHeader(f, bytes)) {
    Serial.printf("[SAVE] WAV header write failed: %s\n", path);
    f.close();
    SD.remove(path);
    return false;
  }

