Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_MicSD_147_ESP32/0519_MicSD_147_ESP32.ino
  uint32_t offset = 0;
  while (offset < bytes) {
    uint32_t chunk = bytes - offset;
    if (chunk > 4096) chunk = 4096;

    size_t written = f.write(data + offset, chunk);
    if (written == 0) {
      Serial.printf("[SAVE] write returned 0: %s\n", path);
      f.close();
      SD.remove(path);
      return false;
    }

    offset += written;
    yield();
  }

  f.flush();
  const uint32_t expectedSize = bytes + 44U;
  const bool sizeOk = f.size() == expectedSize;
  f.close();

  if (!sizeOk) {
    Serial.printf("[SAVE] truncated %s (expected %lu bytes)\n",
                  path, (unsigned long)expectedSize);
    SD.remove(path);
    return false;
  }

  Serial.printf("[SAVE] OK %s, data=%lu, total=%lu\n",
                path, (unsigned long)bytes, (unsigned long)expectedSize);
  return true;
}

static bool writeStatsCsv() {
  if (!mountSd()) return false;

  SD.remove("/COEXSTAT.CSV");
  File f = SD.open("/COEXSTAT.CSV", FILE_WRITE);
  if (!f) return false;

  bool ok = f.println("type,mean,peak,rms,bytes,elapsed_ms,notch_hz") > 0;
  ok = f.printf("raw,%ld,%lu,%lu,%lu,%lu,%.1f\n",
           (long)rawStats.mean,
           (unsigned long)rawStats.peak,
           (unsigned long)rawStats.rms,
           (unsigned long)rawStats.bytes,
           (unsigned long)rawStats.elapsedMs,
           detectedNoiseHz) > 0 && ok;
  ok = f.printf("hp,%ld,%lu,%lu,%lu,%lu,%.1f\n",
           (long)hpStats.mean,
           (unsigned long)hpStats.peak,
           (unsigned long)hpStats.rms,
           (unsigned long)hpStats.bytes,
           (unsigned long)hpStats.elapsedMs,
           detectedNoiseHz) > 0 && ok;
  ok = f.printf("dsp,%ld,%lu,%lu,%lu,%lu,%.1f\n",
           (long)dspStats.mean,
           (unsigned long)dspStats.peak,
           (unsigned long)dspStats.rms,
           (unsigned long)dspStats.bytes,
           (unsigned long)dspStats.elapsedMs,
           detectedNoiseHz) > 0 && ok;
  f.flush();
  ok = f.size() > 0 && ok;
  f.close();
  if (!ok) {
    Serial.println("[SAVE] stats CSV write failed");
    SD.remove("/COEXSTAT.CSV");
  }
  return ok;
}

// ========================= I2S PDM =========================

static void deinitMic() {
#if ESP_IDF_VERSION_MAJOR >= 5
  if (g_i2sRxChan) {
    i2s_channel_disable(g_i2sRxChan);
    i2s_del_channel(g_i2sRxChan);
    g_i2sRxChan = nullptr;
  }
#else
  i2s_driver_uninstall(I2S_PORT);
#endif
}

static bool initMicPdm() {
  deinitMic();

#if ESP_IDF_VERSION_MAJOR >= 5
  i2s_chan_config_t chanCfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  chanCfg.dma_desc_num = 4;
  chanCfg.dma_frame_num = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_new_channel(&chanCfg, nullptr, &g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_new_channel failed: %d\n", (int)err);
    return false;
  }

  i2s_pdm_rx_config_t pdmCfg = {};
  pdmCfg.clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(MIC_SAMPLE_RATE_HZ);
  pdmCfg.slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO);
  pdmCfg.gpio_cfg.clk = (gpio_num_t)MIC_CLK_PIN;
  pdmCfg.gpio_cfg.din = (gpio_num_t)MIC_DATA_PIN;
  pdmCfg.gpio_cfg.invert_flags.clk_inv = MIC_CLK_INVERT;

  err = i2s_channel_init_pdm_rx_mode(g_i2sRxChan, &pdmCfg);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_channel_init_pdm_rx_mode failed: %d\n", (int)err);
    deinitMic();
    return false;
  }

#if REDUCE_PDM_CLK_DRIVE
  gpio_set_drive_capability((gpio_num_t)MIC_CLK_PIN, GPIO_DRIVE_CAP_0);
#endif

  err = i2s_channel_enable(g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_channel_enable failed: %d\n", (int)err);
    deinitMic();
    return false;
  }

  Serial.println("[MIC] PDM RX OK");
  return true;

#else
  i2s_driver_uninstall(I2S_PORT);

  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
  cfg.sample_rate = MIC_SAMPLE_RATE_HZ;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  cfg.communication_format = I2S_COMM_FORMAT_I2S;
  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 4;
  cfg.dma_buf_len = MIC_SAMPLES_PER_READ;
  cfg.use_apll = false;
  cfg.tx_desc_auto_clear = false;
  cfg.fixed_mclk = 0;

  esp_err_t err = i2s_driver_install(I2S_PORT, &cfg, 0, nullptr);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_driver_install failed: %d\n", (int)err);
    return false;
  }

  i2s_pin_config_t pins = {};
  pins.bck_io_num = I2S_PIN_NO_CHANGE;
  pins.ws_io_num = MIC_CLK_PIN;
  pins.data_out_num = I2S_PIN_NO_CHANGE;
  pins.data_in_num = MIC_DATA_PIN;

  err = i2s_set_pin(I2S_PORT, &pins);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_set_pin failed: %d\n", (int)err);
    return false;
  }

  i2s_zero_dma_buffer(I2S_PORT);
  Serial.println("[MIC] PDM RX OK legacy");
  return true;
#endif
}

static bool readMicBlock(size_t *bytesRead) {
  *bytesRead = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
  if (!g_i2sRxChan) return false;
  esp_err_t err = i2s_channel_read(
    g_i2sRxChan,
    (void *)micBuf,
    sizeof(micBuf),
    bytesRead,
    pdMS_TO_TICKS(50)
  );
#else
  esp_err_t err = i2s_read(
    I2S_PORT,
    (void *)micBuf,
    sizeof(micBuf),
    bytesRead,
    pdMS_TO_TICKS(50)
  );
#endif

  return (err == ESP_OK && *bytesRead > 0);
}

static void discardWarmup(uint32_t ms) {
  uint32_t start = millis();
  size_t bytesRead = 0;

  while (millis() - start < ms) {
    readMicBlock(&bytesRead);
    yield();
  }
}

// ========================= Audio processing =========================

static AudioStats computeStats(const int16_t *samples, uint32_t sampleCount, uint32_t bytes, uint32_t elapsedMs) {
  AudioStats s = {};
  s.bytes = bytes;
  s.elapsedMs = elapsedMs;

  if (sampleCount == 0) return s;

  int64_t sum = 0;
  for (uint32_t i = 0; i < sampleCount; i++) {
    sum += samples[i];
  }

  s.mean = (int32_t)(sum / (int64_t)sampleCount);

  uint32_t peak = 0;
  uint64_t sq = 0;

  for (uint32_t i = 0; i < sampleCount; i++) {
    int32_t v = (int32_t)samples[i] - s.mean;
    uint32_t a = (v < 0) ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * (uint64_t)a;
  }

  s.peak = peak;
  s.rms = (uint32_t)sqrt((double)sq / (double)sampleCount);
  return s;
}

