Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_MicSD_147_ESP32/0519_MicSD_147_ESP32.ino
static float goertzelPower(const int16_t *samples, uint32_t sampleCount, float freqHz) {
  float normalizedFreq = freqHz / (float)MIC_SAMPLE_RATE_HZ;
  float coeff = 2.0f * cosf(2.0f * PI * normalizedFreq);

  float q0 = 0.0f;
  float q1 = 0.0f;
  float q2 = 0.0f;

  for (uint32_t i = 0; i < sampleCount; i++) {
    q0 = coeff * q1 - q2 + (float)samples[i];
    q2 = q1;
    q1 = q0;
  }

  return q1 * q1 + q2 * q2 - coeff * q1 * q2;
}

static float detectDominantNoiseHz(const int16_t *samples, uint32_t sampleCount) {
  if (!samples || sampleCount < 1024) return 0.0f;

  // Remove mean from a short profile in place would damage raw;
  // instead estimate mean and subtract during Goertzel by using a temporary centered value is expensive.
  // For tonal LCD noise search above 300 Hz, DC has little effect, so raw search is OK.

  float bestHz = 0.0f;
  float bestPower = 0.0f;

  for (uint32_t f = NOTCH_SEARCH_START_HZ; f <= NOTCH_SEARCH_END_HZ; f += NOTCH_SEARCH_STEP_HZ) {
    float p = goertzelPower(samples, sampleCount, (float)f);
    if (p > bestPower) {
      bestPower = p;
      bestHz = (float)f;
    }
    yield();
  }

  return bestHz;
}

static void makeHpInPlace(int16_t *samples, uint32_t sampleCount, AudioStats *statsOut, uint32_t elapsedMs) {
  if (!samples || sampleCount == 0) return;

  int64_t sum = 0;
  for (uint32_t i = 0; i < sampleCount; i++) {
    sum += samples[i];
  }

  const float dc = (float)((int32_t)(sum / (int64_t)sampleCount));
  const float alpha = 0.97f;

  float prevX = 0.0f;
  float prevY = 0.0f;

  uint32_t peak = 0;
  uint64_t sq = 0;

  for (uint32_t i = 0; i < sampleCount; i++) {
    float x = (float)samples[i] - dc;
    float y = alpha * (prevY + x - prevX);
    prevX = x;
    prevY = y;

    int32_t v = (int32_t)(y * CLEAN_GAIN);

    if (CLEAN_NOISE_GATE > 0 && abs(v) < CLEAN_NOISE_GATE) {
      v = 0;
    }

    if (v > 32767) v = 32767;
    if (v < -32768) v = -32768;

    samples[i] = (int16_t)v;

    uint32_t a = (v < 0) ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * (uint64_t)a;
  }

  statsOut->mean = 0;
  statsOut->peak = peak;
  statsOut->rms = (uint32_t)sqrt((double)sq / (double)sampleCount);
  statsOut->bytes = sampleCount * sizeof(int16_t);
  statsOut->elapsedMs = elapsedMs;
}

static void applyNotchInPlace(int16_t *samples, uint32_t sampleCount, float freqHz, float q) {
  if (!samples || sampleCount == 0) return;
  if (freqHz < 50.0f || freqHz > ((float)MIC_SAMPLE_RATE_HZ * 0.48f)) return;

  float w0 = 2.0f * PI * freqHz / (float)MIC_SAMPLE_RATE_HZ;
  float cw = cosf(w0);
  float sw = sinf(w0);
  float alpha = sw / (2.0f * q);

  float b0 = 1.0f;
  float b1 = -2.0f * cw;
  float b2 = 1.0f;
  float a0 = 1.0f + alpha;
  float a1 = -2.0f * cw;
  float a2 = 1.0f - alpha;

  b0 /= a0;
  b1 /= a0;
  b2 /= a0;
  a1 /= a0;
  a2 /= a0;

  float x1 = 0.0f;
  float x2 = 0.0f;
  float y1 = 0.0f;
  float y2 = 0.0f;

  for (uint32_t i = 0; i < sampleCount; i++) {
    float x0 = (float)samples[i];
    float y0 = b0 * x0 + b1 * x1 + b2 * x2 - a1 * y1 - a2 * y2;

    x2 = x1;
    x1 = x0;
    y2 = y1;
    y1 = y0;

    int32_t v = (int32_t)y0;
    if (v > 32767) v = 32767;
    if (v < -32768) v = -32768;
    samples[i] = (int16_t)v;
  }
}

static void applyAutoDspInPlace(int16_t *samples, uint32_t sampleCount, float baseHz, AudioStats *statsOut, uint32_t elapsedMs) {
  if (!samples || sampleCount == 0) return;

  if (baseHz >= 100.0f) {
    Serial.printf("[DSP] apply notch %.1f Hz\n", baseHz);
    applyNotchInPlace(samples, sampleCount, baseHz, NOTCH_Q);

    float h2 = baseHz * 2.0f;
    float h3 = baseHz * 3.0f;
    if (h2 < MIC_SAMPLE_RATE_HZ * 0.48f) {
      Serial.printf("[DSP] apply notch %.1f Hz\n", h2);
      applyNotchInPlace(samples, sampleCount, h2, NOTCH_Q);
    }
    if (h3 < MIC_SAMPLE_RATE_HZ * 0.48f) {
      Serial.printf("[DSP] apply notch %.1f Hz\n", h3);
      applyNotchInPlace(samples, sampleCount, h3, NOTCH_Q);
    }
  }

  *statsOut = computeStats(samples, sampleCount, sampleCount * sizeof(int16_t), elapsedMs);
}

// ========================= Recording flow =========================

static bool captureWithLcdOn() {
  if (!recBuffer) {
    Serial.println("[REC] no RAM buffer");
    return false;
  }

  sdEndForRecording();
  showRecordingStatic();

  Serial.println("[REC] start capture: LCD ON/static, SD ended, RAM only");

  if (!initMicPdm()) {
    Serial.println("[REC] mic init failed");
    return false;
  }

  discardWarmup(300);

  uint32_t bytesCaptured = 0;
  uint32_t startMs = millis();

  while (bytesCaptured < RECORD_TARGET_BYTES) {
    size_t bytesRead = 0;
    if (!readMicBlock(&bytesRead)) {
      yield();
      continue;
    }

    uint32_t remain = RECORD_TARGET_BYTES - bytesCaptured;
    uint32_t copyBytes = (bytesRead > remain) ? remain : bytesRead;

    memcpy(recBuffer + bytesCaptured, (const uint8_t *)micBuf, copyBytes);
    bytesCaptured += copyBytes;

    yield();
  }

  uint32_t elapsedMs = millis() - startMs;
  deinitMic();

  rawStats = computeStats((const int16_t *)recBuffer, RECORD_TARGET_SAMPLES, bytesCaptured, elapsedMs);

  Serial.printf("[REC] done: bytes=%lu elapsed=%lu ms mean=%ld peak=%lu rms=%lu\n",
                (unsigned long)rawStats.bytes,
                (unsigned long)rawStats.elapsedMs,
                (long)rawStats.mean,
                (unsigned long)rawStats.peak,
                (unsigned long)rawStats.rms);

  return (bytesCaptured == RECORD_TARGET_BYTES);
}

static bool runRecordSaveFlow() {
  if (busy) return false;
  busy = true;

  bool ok = captureWithLcdOn();

  if (ok) {
    uint32_t profileSamples = PROFILE_SAMPLES;
    if (profileSamples > RECORD_TARGET_SAMPLES) profileSamples = RECORD_TARGET_SAMPLES;

    detectedNoiseHz = detectDominantNoiseHz((const int16_t *)recBuffer, profileSamples);
    Serial.printf("[DSP] detected dominant profile frequency: %.1f Hz\n", detectedNoiseHz);

    Serial.println("[SAVE] save raw WAV");
    ok = writeBufferToWav("/COEX_RAW.WAV", recBuffer, RECORD_TARGET_BYTES);
  }

  if (ok) {
    Serial.println("[PROC] make HP in place");
    makeHpInPlace((int16_t *)recBuffer, RECORD_TARGET_SAMPLES, &hpStats, rawStats.elapsedMs);

    Serial.printf("[PROC] HP stats: peak=%lu rms=%lu gain=%.1f\n",
                  (unsigned long)hpStats.peak,
                  (unsigned long)hpStats.rms,
                  CLEAN_GAIN);

    Serial.println("[SAVE] save HP WAV");
    ok = writeBufferToWav("/COEX_HP.WAV", recBuffer, RECORD_TARGET_BYTES);
  }

  if (ok) {
    Serial.println("[PROC] apply auto notch DSP in place");
    applyAutoDspInPlace((int16_t *)recBuffer, RECORD_TARGET_SAMPLES, detectedNoiseHz, &dspStats, rawStats.elapsedMs);

    Serial.printf("[PROC] DSP stats: peak=%lu rms=%lu notch=%.1f\n",
                  (unsigned long)dspStats.peak,
                  (unsigned long)dspStats.rms,
                  detectedNoiseHz);

    Serial.println("[SAVE] save DSP WAV");
    ok = writeBufferToWav("/COEX_DSP.WAV", recBuffer, RECORD_TARGET_BYTES);
  }

  if (ok) {
    ok = writeStatsCsv();
  }

  showDone(ok);

  busy = false;
  return ok;
}

// ========================= Button =========================

static void checkButton() {
  if (busy) return;

  uint32_t now = millis();
  if (now - lastButtonMs < 80) return;

  static int lastStable = HIGH;
  int current = digitalRead(BTN_RECORD_PIN);

  if (current != lastStable) {
    lastButtonMs = now;
    lastStable = current;

    if (current == LOW) {
      runRecordSaveFlow();
    }
  }
}

// ========================= Arduino entry =========================

void setup() {
  Serial.begin(115200);
  delay(900);

  disableRadios();
  printHeader();

  spiDevicesIdle();
  pinMode(BTN_RECORD_PIN, INPUT_PULLUP);

  recBuffer = (uint8_t *)malloc(RECORD_TARGET_BYTES);
  if (!recBuffer) {
    Serial.printf("[RAM] malloc failed: %lu bytes, free=%lu\n",
                  (unsigned long)RECORD_TARGET_BYTES,
                  (unsigned long)ESP.getFreeHeap());
    return;
  }

  Serial.printf("[RAM] OK: %lu bytes allocated, free=%lu\n",
                (unsigned long)RECORD_TARGET_BYTES,
                (unsigned long)ESP.getFreeHeap());

  initLcd();
  showReady();

  delay(900);
  runRecordSaveFlow();
}

void loop() {
  checkButton();
  delay(5);
}
